Tekla.Structures.Geometry3d.Distance
The Distance class contains methods for calculating the distance between geometric objects.

Tekla.Structures.Geometry3d.Distance.PointToPoint(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Returns the distance between the given two points.
Point1: The first point to be used.
Point2: The second point to be used.
Returns: The distance between the given points.

Tekla.Structures.Geometry3d.Distance.PointToLine(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Line)
Returns the distance between the given point and line.
Point: The point to be used.
Line: The line to be used.
Returns: The distance between the given point and line.

Tekla.Structures.Geometry3d.Distance.PointToLineSegment(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.LineSegment)
Returns the distance between the given point and line segment.
Point: The point to be used.
LineSegment: The line segment to be used.
Returns: The distance between the given point and line segment.

Tekla.Structures.Geometry3d.Distance.PointToPlane(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.GeometricPlane)
Returns the distance between the given point and plane.
Point: The point to be used.
Plane: The plane to be used.
Returns: The distance between the given point and plane.